[{"html":"<p>Mark your calendars for Wednesday at 8pm for a Don&#39;t Panic! semester kick off! We&#39;ll be hanging out and playing some games on backyard.co, so swing on by if you can!</p>\n","title":"Kickoff Game Night","date":"2021-01-28T02:00:00.000Z","image":"2021-01-kickoff-game-night.png"},{"html":"<p>Come hear some hiring perspectives tips &amp; what makes a potential candidate stand out!</p>\n","title":"Get Seen: Tips From a Hiring Perspective","date":"2021-02-17T23:00:00.000Z","image":"2021-02-tips-from-a-hiring-perspective.jpg"},{"html":"<p>Your resident web developer board members Alex Rose and Henry Fellerhoff will be going over how to create a good-looking portfolio/resume/personal site. If you recall, our recruiters from the last meeting specifically said that they check portfolio sites in the hiring process, so it is a useful asset to not only have but to help differentiate yourself within a pool of job applicants.</p>\n","title":"How to stand out amongst the crowd: creating a portfolio.","date":"2021-03-24T23:30:00.000Z","image":"2021-03-creating-a-portfolio.png"},{"html":"<p>Join us for an introduction to web development on Tuesday at 4:15 PM in Cudahy room 200. We will be introducing basics of HTML, CSS, and JavaScript!</p>\n","title":"Introduction to web development","date":"2021-10-19T21:15:00.000Z","image":"Fall_2021_-_Introduction_to_Web_Development.png"},{"html":"<p>This semester&#39;s kick off will take place on Tuesday, 4pm, in Cudahy room 200. There will be snacks, so swing on by if you can!</p>\n","title":"Kickoff Meeting","date":"2021-09-28T21:00:00.000Z","image":"Fall_2021_-_Kickoff_Meeting.png"},{"html":"<p>A new semester brings new changes! </p>\n<p>Before the fall semester, We will be changing our <a href=\"https://dont-panic-luc.github.io/e-board\">E-Board</a>.</p>\n<p>During Fall 2021, will be transitioning into in-person events! </p>\n<p>Stay Tuned!</p>\n","title":"Fall Semester Changes","date":"2021-08-30T00:00:00.000Z","image":"Fall.jpg"}]