[{"html":"<p>Mark your calendars for Wednesday at 8pm for a Don&#39;t Panic! semester kick off! We&#39;ll be hanging out and playing some games on backyard.co, so swing on by if you can!</p>\n","title":"Kickoff Game Night","date":"2021-01-28T02:00:00.000Z","image":"2021-01-kickoff-game-night.png"},{"html":"<p>Come hear some hiring perspectives tips &amp; what makes a potential candidate stand out!</p>\n","title":"Get Seen: Tips From a Hiring Perspective","date":"2021-02-17T23:00:00.000Z","image":"2021-02-tips-from-a-hiring-perspective.jpg"},{"html":"<p>Your resident web developer board members Alex Rose and Henry Fellerhoff will be going over how to create a good-looking portfolio/resume/personal site. If you recall, our recruiters from the last meeting specifically said that they check portfolio sites in the hiring process, so it is a useful asset to not only have but to help differentiate yourself within a pool of job applicants.</p>\n","title":"How to stand out amongst the crowd: creating a portfolio.","date":"2021-03-24T23:30:00.000Z","image":"2021-03-creating-a-portfolio.png"},{"html":"<p>A new semester brings new changes! </p>\n<p>Before the fall semester, We will be changing our <a href=\"https://dont-panic-luc.github.io/e-board\">E-Board</a>.</p>\n<p>During Fall 2021, will be transitioning into in-person events! </p>\n<p>Stay Tuned!</p>\n","title":"Fall Semester Changes","date":"2021-08-30T00:00:00.000Z","image":"fall.jpg"},{"html":"<p>We have a total of 7 positions up for grabs. We made slides summarizing the roles of all these positions, although they definitely overstate how much work you will do on a weekly basis. </p>\n<p><a href=\"https://docs.google.com/presentation/d/1A493-ZGcYC705pZlOwyEDWU07T4lFSM36jb_d7j723Y/edit?usp=sharing\">You can view the slides here</a></p>\n<p><a href=\"https://forms.gle/JspE7qm1hDWe286G7\">If you’re interested, apply here (it’s extremely easy and most of the questions are optional)</a></p>\n","title":"Board Application Deadline","date":"2021-04-19T00:00:00.000Z","image":"tbd.png"}]