[{"html":"<p>Mark your calendars for Wednesday at 8pm for a Don&#39;t Panic! semester kick off! We&#39;ll be hanging out and playing some games on backyard.co, so swing on by if you can!</p>\n","title":"Kickoff Game Night","date":"2021-01-28T02:00:00.000Z","image":"2021-01-kickoff-game-night.png"},{"html":"<p>Come hear some hiring perspectives tips &amp; what makes a potential candidate stand out!</p>\n","title":"Get Seen: Tips From a Hiring Perspective","date":"2021-02-17T23:00:00.000Z","image":"2021-02-tips-from-a-hiring-perspective.jpg"},{"html":"<p>Your resident web developer board members Alex Rose and Henry Fellerhoff will be going over how to create a good-looking portfolio/resume/personal site. If you recall, our recruiters from the last meeting specifically said that they check portfolio sites in the hiring process, so it is a useful asset to not only have but to help differentiate yourself within a pool of job applicants.</p>\n","title":"How to stand out amongst the crowd: creating a portfolio.","date":"2021-03-24T23:30:00.000Z","image":"2021-03-creating-a-portfolio.png"},{"html":"<p>Join us for an introduction to web development on Tuesday at 4:15 PM in Cudahy room 200. We will be introducing basics of HTML, CSS, and JavaScript!</p>\n","title":"Introduction to web development","date":"2021-10-19T21:15:00.000Z","image":"Fall_2021_-_Introduction_to_Web_Development.png"},{"html":"<p>This semester&#39;s kick off will take place on Tuesday, 4pm, in Cudahy room 200. There will be snacks, so swing on by if you can!</p>\n","title":"Kickoff Meeting","date":"2021-09-28T21:00:00.000Z","image":"Fall_2021_-_Kickoff_Meeting.png"},{"html":"<p>Join us this coming Tuesday, November 2nd from 4:20-5:00pm in Cudahy Science Hall Room 200 to hang out with the club and learn about the classes to take and avoid for this upcoming semester. This is a pretty relaxed meeting, so swing by for however long you&#39;d like!</p>\n","title":"Registration Bonanza","date":"2021-11-02T21:20:00.000Z","image":"Fall_2021_-_Registration_Bonanza.png"},{"html":"<p>A new semester brings new changes! </p>\n<p>Before the fall semester, We will be changing our <a href=\"https://dont-panic-luc.github.io/e-board\">E-Board</a>.</p>\n<p>During Fall 2021, will be transitioning into in-person events! </p>\n<p>Stay Tuned!</p>\n","title":"Fall Semester Changes","date":"2021-08-30T00:00:00.000Z","image":"Fall.jpg"},{"html":"<p>Join Don&#39;t Panic!&#39;s eboard this semester, as well as securing positions for next year! Open positions are Head of Marketing, CAN Representative, Lead Website Developer, Treasurer, and registration closes on February 15th.</p>\n","title":"Eboard Registration","date":"2023-02-15T23:55:00.000Z","image":"Spring_2023_eboard-registration.png"},{"html":"<p>Our second game night is going to be this Wednesday March 1st at 7:00 PM in Cuneo 117! Just like last time we&#39;re going to have Mario kart and super smash bros on the Nintendo switch along with some other fun computer science themed games! There&#39;s gonna be free pizza so make sure to come!</p>\n","title":"Game Night","date":"2023-03-01T19:00:00.000Z","image":"2023-03-game-night.jpg"}]